  ### Deployment Results ❌

  **JamesHaughey** had a failure when deploying branch `feature/add-layers` to **production**

  <details><summary>Show Results</summary>

  ```terraform
Acquiring state lock. This may take a few moments...
module.iam_role.data.aws_iam_policy_document.default[0]: Reading...
module.iam_role.data.aws_iam_policy_document.assume_role[0]: Reading...
module.iam_role.data.aws_iam_policy_document.default[0]: Read complete after 0s [id=1132004489]
module.iam_role.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3644156030]
module.iam_role.data.aws_iam_policy_document.assume_role_aggregated[0]: Reading...
module.iam_role.data.aws_iam_policy_document.assume_role_aggregated[0]: Read complete after 0s [id=3644156030]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.iam_role.aws_iam_policy.default[0] will be created
+ resource "aws_iam_policy" "default" {
    + arn       = (known after apply)
    + id        = (known after apply)
    + name      = "elbokade"
    + path      = "/"
    + policy    = jsonencode(
          {
            + Version = "2012-10-17"
          }
      )
    + policy_id = (known after apply)
    + tags      = {
        + "Name"      = "elbokade"
        + "Namespace" = "elbokade"
      }
    + tags_all  = {
        + "Name"      = "elbokade"
        + "Namespace" = "elbokade"
      }
  }

# module.iam_role.aws_iam_role.default[0] will be created
+ resource "aws_iam_role" "default" {
    + arn                   = (known after apply)
    + assume_role_policy    = jsonencode(
          {
            + Statement = [
                + {
                    + Action    = [
                        + "sts:TagSession",
                        + "sts:AssumeRole",
                      ]
                    + Effect    = "Allow"
                    + Principal = {
                        + Service = "lambda.amazonaws.com"
                      }
                    + Sid       = ""
                  },
              ]
            + Version   = "2012-10-17"
          }
      )
    + create_date           = (known after apply)
    + description           = "Test role"
    + force_detach_policies = false
    + id                    = (known after apply)
    + managed_policy_arns   = (known after apply)
    + max_session_duration  = 3600
    + name                  = "elbokade"
    + name_prefix           = (known after apply)
    + path                  = "/"
    + tags                  = {
        + "Name"      = "elbokade"
        + "Namespace" = "elbokade"
      }
    + tags_all              = {
        + "Name"      = "elbokade"
        + "Namespace" = "elbokade"
      }
    + unique_id             = (known after apply)

    + inline_policy {
        + name   = (known after apply)
        + policy = (known after apply)
      }
  }

# module.iam_role.aws_iam_role_policy_attachment.default[0] will be created
+ resource "aws_iam_role_policy_attachment" "default" {
    + id         = (known after apply)
    + policy_arn = (known after apply)
    + role       = "elbokade"
  }

Plan: 3 to add, 0 to change, 0 to destroy.
module.iam_role.aws_iam_policy.default[0]: Creating...
module.iam_role.aws_iam_role.default[0]: Creating...
module.iam_role.aws_iam_role.default[0]: Creation complete after 1s [id=elbokade]
Releasing state lock. This may take a few moments...

```

  </details>